JanWelker/bike_comm/firmware/sdkconfig.defaults
# Target: original ESP32 (LX6, with PSRAM)
CONFIG_IDF_TARGET="esp32"

# PSRAM (WROVER-E/IE has 8 MB) — required for ESP-SR AFE
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Bluetooth: Classic (BR/EDR) only — we are HFP-HF + A2DP-sink + AVRCP-CT
# to the phone. We do not use BLE; BR_EDR_ONLY at the controller level
# excludes the BLE stack from the build entirely (vs. BTDM which reserves
# DRAM for both even if unused) — the smallest DRAM win available on the
# LX6 single-radio path, which matters because the app partition is
# already ~95% full and Bluedroid HFP+A2DP is a heavy add.
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
# (SSP is on by default in IDF 5.5 when Bluedroid Classic is enabled —
# no explicit CONFIG_BT_SSP_ENABLED switch any more; IDF complained when
# we tried to set it 2026-06-12. We rely on the default + set IO cap
# = NoInputNoOutput in bt_classic_init for Just Works pairing.)
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_HFP_ENABLE=y
CONFIG_BT_HFP_CLIENT_ENABLE=y
CONFIG_BT_HFP_AUDIO_DATA_PATH_HCI=y
CONFIG_BT_HFP_WBS_ENABLE=y

# Wi-Fi (needed for ESP-NOW; we won't associate with an AP)
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_NVS_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# Coex (BT Classic + Wi-Fi/ESP-NOW share the radio — see firmware/main/coex.c)
CONFIG_SW_COEXIST_ENABLE=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Flash size — WROVER-E modules ship with 4 MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Partition table — custom (OTA-ready, room for ESP-SR models in PSRAM-backed flash)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Stack sizes — audio tasks need headroom
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# IRAM diet — Stage 3 SCO ring buffers push the linker past iram0_0_seg
# (~465 B free before, +bt_audio.c via xRingbuffer dragged us 2.3 KB
# over). Moving ringbuf + FreeRTOS list helpers to flash buys back the
# headroom. The audio hot path doesn't call ringbuf from an ISR, so
# the flash-resident version is fine.
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH=y
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
